{
  "index": {
    "betaTitle": "Version Beta",
    "betaMessage": "Veuillez prendre en compte qu'il s'agit d'une version BETA.",
    "indexTitle": "Qu'est-ce que Com2kube?",
    "introduction": "Le but de cette application est de vous faciliter la vie en convertissant un fichier docker-compose en objets Kubernetes facilement.",
    "steps": "Vous pouvez effectuer la conversion du fichier docker-compose en trois étapes faciles:",
    "step1": "1. Cliquez sur le bouton 'Choose File'.",
    "step2": "2. Sélectionnez votre fichier docker-compose.yml.",
    "step3": "3. Soumettre",
    "disclaimer": "Avertissement: Nous ne sauvegardons aucun de vos fichiers soumis."
  },
  "fileUpload": {
    "submitBtn": "Soumettre"
  },
  "fileSample": {
    "downloadBtn": "Télécharger un échantillon",
    "sampleLabel": "Vous pouvez l'utiliser pour essayer Com2kube!"
  },
  "fileDownload": {
    "downloadFileBtn": "Télécharger le fichier converti"
  },
  "about": {
    "teamHeader": "L'équipe",
    "backendDev": "Développeur backend/DevOps",
    "frontendDev": "Développeur frontend",
    "menu": "À propos",
    "item1": "Salut à tous!",
    "item2": "Nous aimerions vous présenter notre premier projet que nous venons à peine de commencer. Il s'agit d'un projet qui nous permet de développer nos connaissances en programmation et nous espérons que vous l'apprécierez autant que nous.",
    "item3": "N'hésitez pas de venir nous voir sur Github et contribuer.",
    "item4": "À bientôt! :)",
    "faq1": "Comment cette application est-elle différente de Kompose?",
    "faq1Text1": "Nous sommes au courant que nos fonctionnalités sont similaires à celle de Kompose CLI.",
    "faq1Text2": "Nous avons créé cet outil afin de permettre aux utilisateurs de convertir leur fichier docker-compose en fichier kubernetes. Comparativement à Kompose qui est un outil CLI que vous devez télécharger. En fait, nous utilisons Kompose dans notre application pour convertir le docker-compse. La différence est que nous laissons les usagers la possibilité de convertir leur fichier de n'importe où. ",
    "faq2": "Sauvegardons-nous votre fichier docker-compose?",
    "faq2Text1": "La réponse est non, on ne le sauvegarde pas.",
    "faq2Text2": "Actuellement, nous n'avons aucune base de données. Ce qui veut dire que nous ne sauvegardons nulle part ce que nous vous envoyez. Lorsque le fichier est soumis et que le résultat vous est parvenu, le fichier est immédiatement supprimé de nos serveurs. "
  },
  "news": {
    "findOutMoreLink": "en savoir plus"
  },
  "footer": {
    "policy": "Politique de confidentialité",
    "terms": "Termes et conditions"
  },
  "privacy": {
    "privacyHeader": "Confidentialité ",
    "introTitle": "Votre confidentialité est extrêmement importante pour nous.",
    "introText1": "La politique de Com2kube est de respecter votre vie privée concernant toute information que nous pouvons collecter lors de l'utilisation de notre site Web. Cette politique de confidentialité s'applique à <a href='https://com2kube.io'> https://com2kube.io </a> (ci-après, «nous», «nous» ou «https://com2kube.io '). Nous respectons votre vie privée et nous nous engageons à protéger les informations personnellement identifiables que vous pouvez nous fournir via le site Web. Nous avons adopté cette politique de confidentialité (`` Politique de confidentialité '') pour expliquer quelles informations peuvent être collectées sur notre site Web, comment nous utilisons ces informations et dans quelles circonstances nous pouvons divulguer ces informations à des tiers. Cette politique de confidentialité s'applique uniquement aux informations que nous collectons via le site Web et ne s'applique pas à notre collecte d'informations provenant d'autres sources.",
    "introText2": "Cette politique de confidentialité, ainsi que les conditions générales publiées sur notre site Web, énonce les règles et politiques générales régissant votre utilisation de notre site Web. En fonction de vos activités lors de la visite de notre site Web, vous devrez peut-être accepter des conditions générales supplémentaires.",
    "websiteTitle": "Visiteurs du site",
    "websiteText1": "Comme la plupart des exploitants de sites Web, Com2kube collecte des informations non personnellement identifiables du type que les navigateurs Web et les serveurs mettent généralement à disposition, telle que le type de navigateur, les préférences linguistiques, le site référent et la date et l'heure de chaque demande de visiteur. L'objectif de Com2kube dans la collecte d'informations non personnelles est de mieux comprendre comment les visiteurs de Com2kube utilisent son site Web. De temps en temps, Com2kube peut divulguer des informations non personnellement identifiables dans l'ensemble, par exemple, en publiant un rapport sur les tendances dans l'utilisation de son site Web.",
    "websiteText2": "Com2kube recueille également des informations potentiellement personnelles telles que les adresses IP (Internet Protocol) pour les utilisateurs connectés et pour les utilisateurs qui laissent des commentaires sur les <blog </a> https://com2kube.io articles de blog. Com2kube ne divulgue les adresses IP des utilisateurs et des commentateurs connectés que dans les mêmes circonstances qu'il utilise et divulgue les informations d'identification personnelle décrites ci-dessous.",
    "personalInfoTitle": "la collecte d'informations d'identification personnelle",
    "personalText1": "Certains visiteurs des sites Web de Com2kube choisissent d'interagir avec Com2kube de manière à obliger Com2kube à recueillir des informations d'identification personnelle. La quantité et le type d'informations collectées par Com2kube dépendent de la nature de l'interaction. Par exemple, nous demandons aux visiteurs qui s'inscrivent à un blog à <a href='https://com2kube.io'> https://com2kube.io </a> de fournir un nom d'utilisateur et une adresse e-mail.",
    "securityTitle": "La sécurité",
    "securityText1": "La sécurité de vos informations personnelles est importante pour nous, mais n'oubliez pas qu'aucune méthode de transmission sur Internet ou méthode de stockage électronique n'est sûre à 100%. Bien que nous nous efforcions d'utiliser des moyens commercialement acceptables pour protéger vos informations personnelles, nous ne pouvons pas garantir leur sécurité absolue.",
    "advertisementsTitle": "La publicité",
    "advertisementsText1": "Les publicités apparaissant sur notre site Web peuvent être transmises aux utilisateurs par des partenaires publicitaires, qui peuvent définir des cookies. Ces cookies permettent au serveur publicitaire de reconnaître votre ordinateur chaque fois qu'il vous envoie une publicité en ligne pour compiler des informations sur vous ou sur les autres utilisateurs de votre ordinateur. Ces informations permettent notamment aux réseaux publicitaires de diffuser des publicités ciblées qui, selon eux, vous intéresseront le plus. Cette politique de confidentialité couvre l'utilisation des cookies par Com2kube et ne couvre pas l'utilisation des cookies par les annonceurs.",
    "externalSitesTitle": "Liens vers des sites externes",
    "externalSitesText1": "Notre service peut contenir des liens vers des sites externes qui ne sont pas exploités par nous. Si vous cliquez sur un lien tiers, vous serez dirigé vers le site de ce tiers. Nous vous conseillons fortement de consulter la politique de confidentialité et les termes et conditions de chaque site que vous visitez.",
    "externalSitesText2": "Nous n'avons aucun contrôle sur, et n'assumons aucune responsabilité pour le contenu, les politiques de confidentialité ou les pratiques des sites, produits ou services tiers.",
    "statsTitle": "Statistiques agrégées",
    "statsText": "Com2kube peut collecter des statistiques sur le comportement des visiteurs de son site Web. Com2kube peut afficher ces informations publiquement ou les fournir à d'autres. Cependant, Com2kube ne divulgue pas vos informations d'identification personnelle.",
    "privacyTitle": "Modifications de la politique de confidentialité",
    "privacyText": "Bien que la plupart des changements soient susceptibles d'être mineurs, Com2kube peut modifier sa politique de confidentialité de temps à autre et à la seule discrétion de Com2kube. Com2kube encourage les visiteurs à consulter fréquemment cette page pour tout changement à sa politique de confidentialité. Votre utilisation continue de ce site après tout changement dans cette politique de confidentialité constituera votre acceptation d'un tel changement."
  },
  "termsConditions": {
    "termConditionsHeader": "Termes et conditions",
    "conditionText1": "Ces termes et conditions décrivent les règles et réglementations pour l'utilisation du site Web de Com2kube.",
    "conditionText2": "En accédant à ce site Web, nous supposons que vous acceptez intégralement ces termes et conditions. Ne continuez pas à utiliser le site Web de Com2kube si vous n'acceptez pas toutes les conditions générales énoncées sur cette page.",
    "conditionText3": "La terminologie suivante s'applique aux présentes conditions générales, à la déclaration de confidentialité et à l'avis de non-responsabilité et à tout ou partie des accords: `` Client '', `` Vous '' et `` Votre '' font référence à vous, la personne accédant à ce site Web et acceptant les termes et conditions de la Société. «La société», «nous-mêmes», «nous», «notre» et «nous» fait référence à notre société. «Partie», «Parties» ou «Us» fait référence à la fois au Client et à nous-mêmes, ou au Client ou à nous-mêmes. Tous les termes se réfèrent à l'offre, l'acceptation et la considération du paiement nécessaires pour entreprendre le processus de notre assistance au Client de la manière la plus appropriée, que ce soit par des réunions formelles d'une durée fixe, ou tout autre moyen, dans le but exprès de rencontrer le Besoins du Client en ce qui concerne la fourniture des services / produits déclarés de la Société, conformément et sous réserve de la loi en vigueur du. Toute utilisation de la terminologie ci-dessus ou d'autres mots au singulier, au pluriel, en majuscules et / ou il ou elles, sont considérés comme interchangeables et donc comme faisant référence à ceux-ci.",
    "cookiesTitles": "Cookies",
    "cookiesText1": "Nous utilisons des cookies. En utilisant le site Web de Com2kube, vous consentez à l'utilisation de cookies conformément à la politique de confidentialité de Com2kube.",
    "cookiesText2": "La plupart des sites Web interactifs modernes utilisent des cookies pour nous permettre de récupérer les détails de l'utilisateur pour chaque visite. Les cookies sont utilisés dans certaines zones de notre site pour permettre la fonctionnalité de cette zone et la facilité d'utilisation pour les visiteurs. Certains de nos partenaires affiliés / publicitaires peuvent également utiliser des cookies.",
    "licenceTitle": "Licence",
    "licenceText1": "Sauf indication contraire, Com2kube et / ou ses concédants de licence détiennent les droits de propriété intellectuelle pour tout le matériel sur Com2kube. Tous les droits de propriété intellectuelle sont réservés. Vous pouvez afficher et / ou imprimer des pages de https://com2kube.io pour votre usage personnel sous réserve des restrictions définies dans les présentes conditions générales.",
    "licenceText2": "Il ne faut pas:",
    "licenceItem1": "Republiez le matériel de https://com2kube.io",
    "licenceItem2": "Vendre, louer ou sous-licencier du matériel de https://com2kube.io",
    "licenceItem3": "Reproduire, dupliquer ou copier du matériel à partir de https://com2kube.io",
    "licenceText3": "Redistribuez le contenu de Com2kube (sauf si le contenu est spécifiquement conçu pour la redistribution).",
    "hyperlinkTitle": "Hyperlien vers notre contenu",
    "hyperlinkItem1": "Les organisations suivantes peuvent créer un lien vers notre site Web sans autorisation écrite préalable:",
    "hyperlinkSub1Item1": "Organismes gouvernementaux;",
    "hyperlinkSub1Item2": "Moteurs de recherche;",
    "hyperlinkSub1Item3": "Organismes de presse;",
    "hyperlinkSub1Item4": "Les distributeurs d'annuaires en ligne, lorsqu'ils nous inscrivent dans l'annuaire, peuvent créer un lien vers notre site Web de la même manière qu'ils font un hyperlien vers les sites Web d'autres entreprises cotées; et",
    "hyperlinkSub1Item5": "Entreprises accréditées à l'échelle du système, à l'exception de la sollicitation d'organisations à but non lucratif, de centres commerciaux de bienfaisance et de collectes de fonds caritatives qui ne peuvent pas créer de lien hypertexte vers notre site Web. ",
    "hyperlinkItem2": "Ces organisations peuvent créer des liens vers notre page d'accueil, des publications ou d'autres informations de site Web tant que le lien: (a) n'est en aucun cas trompeur; (b) n'implique pas faussement un parrainage, une approbation ou une approbation de la partie de liaison et de ses produits ou services; et (c) s'inscrit dans le contexte du site de la partie de liaison.",
    "hyperlinkSub2Item1": "Nous pouvons considérer et approuver à notre seule discrétion d'autres demandes de lien des types d'organisations suivants:",
    "hyperlinkSub2Item3": "sites communautaires dot.com;",
    "hyperlinkSub2Item4": "les associations ou autres groupes représentant des organismes de bienfaisance, y compris les sites de dons caritatifs,",
    "hyperlinkSub2Item5": "distributeurs d'annuaires en ligne; et",
    "hyperlinkSub2Item6": "portails Internet.",
    "hyperlinkText1": "Nous approuverons les demandes de lien de ces organisations si nous déterminons que: (a) le lien ne nuirait pas à nous ou à nos entreprises accréditées (par exemple, les associations professionnelles ou d'autres organisations représentant des types d'entreprise intrinsèquement suspects, comme le travail en entreprise) les possibilités d'accueil, ne seront pas autorisés à faire le lien); (b) l'organisation n'a pas de dossier insatisfaisant avec nous; (c) l'avantage pour nous de la visibilité associée à l'hyperlien l'emporte sur l'absence de Com2kube; et (d) lorsque le lien se trouve dans le contexte d'informations générales sur les ressources ou est par ailleurs cohérent avec le contenu éditorial d'un bulletin d'information ou d'un produit similaire faisant avancer la mission de l'organisation.",
    "hyperlinkText2": "Ces organisations peuvent créer un lien vers notre page d'accueil, des publications ou d'autres informations de site Web tant que le lien: (a) n'est en aucun cas trompeur; (b) n'implique pas faussement le parrainage, l'approbation ou l'approbation de la partie de liaison et ses produits ou services; et (c) s'inscrit dans le contexte du site de la partie de liaison.",
    "hyperlinkText3": " Si vous faites partie des organisations énumérées au paragraphe 2 ci-dessus et que vous souhaitez créer un lien vers notre site Web, vous devez nous en informer en envoyant un e-mail à ",
    "hyperlinkEmail": "com2kube@gmail.com",
    "hyperlinkText4": ". Veuillez inclure votre nom, le nom de votre organisation, vos coordonnées (comme un numéro de téléphone et / ou une adresse e-mail) ainsi que l'URL de votre site, une liste de toutes les URL à partir desquelles vous avez l'intention de créer un lien vers notre site Web, et une liste des URL de notre site vers lesquelles vous souhaitez créer un lien. Prévoyez 2-3 semaines pour une réponse.",
    "hyperlinkText5": "Les organisations approuvées peuvent créer un lien hypertexte vers notre site Web comme suit:",
    "hyperlinkSub3Item1": "En utilisant notre raison sociale; ou",
    "hyperlinkSub3Item2": "En utilisant le localisateur de ressources uniforme (adresse Web) lié à; ou",
    "hyperlinkSub3Item3": "En utilisant toute autre description de notre site Web ou du matériel lié à qui a du sens dans le contexte et le format du contenu sur le site de la partie de liaison.",
    "hyperlinkText6": " Aucune utilisation du logo ou d'autres illustrations de Com2kube ne sera autorisée pour le lien en l'absence d'un accord de licence de marque.",
    "iFrameTitle": "Iframes",
    "iFrameText": "Sans autorisation préalable et autorisation écrite expresse, vous ne pouvez pas créer de cadres autour de nos pages Web ou utiliser d'autres techniques qui altèrent de quelque manière la présentation visuelle ou l'apparence de notre site Web",
    "rightsTitle": "Réserve de droits",
    "rightsText": "Nous nous réservons le droit à tout moment et à sa seule discrétion de vous demander de supprimer tous les liens ou tout lien particulier vers notre site Web. Vous acceptez de supprimer immédiatement tous les liens vers notre site Web sur une telle demande. Nous nous réservons également le droit de modifier ces termes et conditions et sa politique de liaison à tout moment. En continuant à créer un lien vers notre site Web, vous acceptez d'être lié à ces conditions générales de liaison et de vous y conformer.",
    "removalLinksTitle": "Suppression de liens de notre site Web",
    "removalLinksText1": "Si vous trouvez un lien sur notre site Web ou tout site Web lié répréhensible pour quelque raison que ce soit, vous pouvez nous contacter à ce sujet. Nous considérerons les demandes de suppression de liens mais n'aurons aucune obligation de le faire ou de vous répondre directement.",
    "removalLinksText2": "Bien que nous nous efforcions de nous assurer que les informations sur ce site Web sont correctes, nous ne garantissons pas leur exhaustivité ou leur exactitude; nous ne nous engageons pas non plus à veiller à ce que le site Web reste disponible ou à ce que le contenu du site Web soit mis à jour.",
    "contentLiabilityTitle": "Responsabilité du contenu",
    "contentLiabilityText": "Nous déclinons toute responsabilité quant à tout contenu apparaissant sur votre site Web. Vous acceptez de nous indemniser et de nous défendre contre toute réclamation découlant de ou basée sur votre site Web. Aucun lien ne peut apparaître sur une page de votre site Web ou dans un contexte contenant du contenu ou des éléments qui peuvent être interprétés comme diffamatoires, obscènes ou criminels, ou qui enfreignent, violent autrement ou préconisent l'infraction ou toute autre violation de tout droits des tiers.",
    "disclaimerTitle": "Avertissement",
    "disclaimerText1": "Dans la mesure maximale permise par la loi applicable, nous excluons toutes les représentations, garanties et conditions relatives à notre site Web et à l'utilisation de ce site Web (y compris, sans limitation, toutes les garanties implicites par la loi en ce qui concerne la qualité satisfaisante, l'adéquation à l'usage et / ou l'utilisation de soins et de compétences raisonnables). Rien dans cette clause de non-responsabilité ne:",
    "disclaimerItem1": "limiter ou exclure notre ou votre responsabilité en cas de décès ou de blessure résultant d'une négligence;",
    "disclaimerItem2": "limiter ou exclure notre ou votre responsabilité pour fraude ou fausse déclaration frauduleuse;",
    "disclaimerItem3": "limiter nos ou vos responsabilités d'une manière non autorisée par la loi applicable; ou",
    "disclaimerItem4": "exclure tout ou partie de nos responsabilités qui ne peuvent être exclues en vertu de la loi applicable.",
    "disclaimerText2": "Les limitations et exclusions de responsabilité énoncées dans cette section et ailleurs dans cette clause de non-responsabilité: (a) sont soumises au paragraphe précédent; et (b) régir toutes les responsabilités découlant de la clause de non-responsabilité ou en relation avec l'objet de la présente clause de non-responsabilité, y compris les responsabilités découlant du contrat, en responsabilité délictuelle (y compris la négligence) et en cas de manquement à une obligation légale.",
    "disclaimerText3": "Dans la mesure où le site Web et les informations et services sur le site Web sont fournis gratuitement, nous ne serons pas responsables de toute perte ou dommage de quelque nature que ce soit."
  }
}
